@ECHO OFF
Title Personal Development
cd /d "%~dp0"
chcp 65001
:START
 echo.
 echo "Това приложение държи личната ти информация тук, не на друт компютър или в нета."
 echo "Възползвай се от това за да бъдеш максимално честен/честна - остава за тебе."
 echo.
 echo.
 pause
 cls
 echo.
 echo                "Когато личността - особеностите на характера и личните решения, се оценяват също така високо както и дори повече от личната ни информация тогава обществото ще се промени."
 echo.
 timeout /t 5
 echo                                   "Поглеждайки се в огледалото, профилът ми най- много прилича на ..."
 ping -n 5 127.0.0.1 > nul
 temperament.jpg
 echo.
 echo.
 echo (1) горен ляв профил  : (2) горен десен профил 
 echo ..............................................
 echo (3) долен ляв профил  : (4) долен десен профил 
 echo.
 echo.
 echo "[ За да продължа, натискам цифрата, която съм избрал/а. ]"
 echo.
CHOICE /c:1234
if errorlevel 4 (
  set temperament='phlegm'
  echo.
  echo "Обръщам внимание на детайлите и ще работя усърдно до постигането на резултати, независимо колко време отнеме. Разбирам се най- добре с долен ляв профил (меланхолик). Най- трудно се разбирам с горен ляв профил (холерик)."
  rem Флегматичен
  pause
  goto :SOMATOTYPE
)
if errorlevel 3 (
  set temperament='melan'
  echo.
  echo "Преценявам внимателно думите и действията ми. Понякога това ми причининява тревожност или чувство на вина, затова се опитвам да съм по- спокоен/спокойна. Намирам опора при долен десен профил (флегматик). Най- трудно говоря с горен десен профил (сангвиник)."
  rem Мелапноличен
  pause
  goto :SOMATOTYPE
)
if errorlevel 2 (
  set temperament='sang'
  echo.
  echo "Харесва ми да се прекарвам добре времето ми с другите. Общувам най- лесно с горен ляв профил (холерик). А най- трудно с долен ляв профил (меланхолик)."
  rem Сангвиничен 
  goto :SOMATOTYPE
)
if errorlevel 1 (
  set temperament='choler'
  echo.
  echo "Развълнувам се лесно и имам бързи реакции, което ме прави склонен/склонна да поемат рискове. Понякога прекалявам с това. Разбирам се най- добре с горен десен профил (сангвиник). Най- трудно ми е да общувам с долен десен профил (флегматик)."
  rem Холеричен
  goto :SOMATOTYPE
)
:SOMATOTYPE
cls
echo.
echo                                    "Тялото ми прилича най- много на ..."
echo.
ping -n 4 127.0.0.1 > nul
somatotype.jpg
echo "1) Това от ляво. 2) Това по средата. 3) Това от дясно."
echo. 
CHOICE /c:123
if errorlevel 3 (
 set metablosim='slow'
 echo "Имам бавен метаболизъм - каквото изям и веднага ми се отразява на фигурата."
 pause
 goto :NATURAL
)
if errorlevel 2 (
 set metablosim='medium'
 echo "Имам балансиран метаболизъм. Тренировките ми се отразяват добре и на фигурата и на самочувствието, защото лесно мога да направя релеф на мускулите."
 pause
 goto :NATURAL
)
if errorlevel 1 (
 set metablosim='fast'
 echo "Имам бърз метаболизъм - мога да ям много, но пак оставам съшите килограми. Въпреки това разбрах, че не мога да създам тяло като на културист колкото и упражнения да правя. Тренировки за издръжливост са най- подходящи за мен."
 pause
 goto :NATURAL
)
:NATURAL
if %temperament%=='melan' if %metablosim%=='fast' echo "На мен ми стига малко и аз съм този/тази, която може да продължи когато другите са изморени и гладни. Поемам отговорност да организирам преговори между другите. " && pause && goto ENERGY
if %temperament%=='melan' if %metablosim%=='medium'  echo "Когато другите ме видят, знаят че имам гъвкава сила и аз ще отгооря на техния зов за помощ без да се поставям в опасност. Поемам отговорност да организирам преговори между другите. " && pause && goto ENERGY
if %temperament%=='melan' if %metablosim%=='slow'  echo "Аз съм стълбът, на които другите се крепят. Мога да правя подвизи на каквито другите не са способдни! Поемам отговорност да организирам преговори между другите." && pause && goto ENERGY

if %temperament%=='phlegm' if %metablosim%=='fast'  echo "На мен ми стига малко и аз съм този/тази, която може да продължи когато другите са изморени и гладни. Поемам отговорност да дам шанс на вскички да изкажат мнението си на преговорите, а не само най- шумните или мнозинството" && pause && goto ENERGY
if %temperament%=='phlegm' if %metablosim%=='medium'  echo "Когато другите ме видят, знаят че имам гъвкава сила и аз ще отгооря на техния зов за помощ без да се поставям в опасност. Поемам отговорност да дам шанс на вскички да изкажат мнението си на преговорите, а не само най- шумните или мнозинството" && pause && goto ENERGY
if %temperament%=='phlegm' if %metablosim%=='slow' echo "Аз съм стълбът, на които другите се крепят. Мога да правя подвизи на каквито другите не са способдни! Поемам отговорност да дам шанс на вскички да изкажат мнението си на преговорите, а не само най- шумните или мнозинството" && pause && goto ENERGY

if %temperament%=='sang' if %metablosim%=='fast'  echo "Поемам отговорност да модерирам преговори и да осигурявам добра обстановка." && pause && goto ENERGY
if %temperament%=='sang' if %metablosim%=='medium'  echo "Когато другите ме видят, знаят че имам гъвкава сила и аз ще отгооря на техния зов за помощ без да се поставям в опасност. Поемам отговорност да модерирам преговори и да осигурявам добра обстановка." && pause && goto ENERGY
if %temperament%=='sang' if %metablosim%=='slow'  echo "Аз съм стълбът, на които другите се крепят. Мога да правя подвизи на каквито другите не са способдни! Поемам отговорност да модерирам преговори и да осигурявам добра обстановка." && pause && goto ENERGY

if %temperament%=='choler' if %metablosim%=='fast' echo "Поемам отговорност да започвам преговори и да ги забързвам когато има шанс да се разпаднат." && pause && goto ENERGY
if %temperament%=='choler' if %metablosim%=='medium'  echo "Когато другите ме видят, знаят че имам гъвкава сила и аз ще отгооря на техния зов за помощ без да се поставям в опасност. Поемам отговорност да започвам преговори и да ги забързвам когато има шанс да се разпаднат." && pause && goto ENERGY
if %temperament%=='choler' if %metablosim%=='slow'  echo "Аз съм стълбът, на които другите се крепят. Мога да правя подвизи на каквито другите не са способдни! Поемам отговорност да започвам преговори и да ги забързвам когато има шанс да се разпаднат." && pause && goto ENERGY

rem ВТОРИ ДЕН
:ENERGY
cls
echo.
echo                                      "Предпочитам да изразя добрите ми чувства към близките хора чрез ..."
ping -n 4 127.0.0.1 > nul
echo.
love.png
echo "1) морална подкрепа, окуражаване"
echo "2) услуга"
echo "3) подарък"
echo "4) добре прекарано време"
echo "5) прегръдка, държане за ръка"
echo.
CHOICE /c:12345
if errorlevel 5 (
 echo.
 echo "При извънредните времена хората са изплашени и дори се страхуват едни от други. Аз мога да им покажа, че все още има топлина в отношенията."
 pause
 goto AURA
)
if errorlevel 4 (
 echo.
 echo "Технологиите уж ни свързаха, но всъщност продължаваме да живеем в свой малък балон. Сега е времето да бъдем заедно не само когато всичко е наред. Да приемем другите с техните недостатъци, а не само в най- добрата им светлина."
 pause
 goto AURA
)
if errorlevel 3 (
 echo.
 echo "Парите менят своята стойност. Сега е времето да разменям вещи на бартер, да договарям цената."
 pause
 goto AURA
) 
if errorlevel 2 (
 echo.
 echo "Парите менят своята стойност. Сега е времето за размяна на услуги. Колкото повече умения имам толкова повече ще мога да взаимодействам и сами ще ме търсят."
 pause
 goto AURA
)
if errorlevel 1 (
 echo.
 echo "При извънредните времена хората са изплашени и искат да се върнат обратно към начина на живот от преди. Аз мога да им помогна да променят начина си на мислене, да пробват нов начин да работят и да живеят."
 pause
 goto AURA
)
:AURA
echo.
echo              "Най- важно е да съхраня моята емоционална чистота. Реакциите са наш личен избор и благосъстоянието на другите не зависи от мен."
pause
cls
echo.
echo "ПРЕДУПРЕЖДЕНИЕ : Следващото себеопознание включва да бъдеш прехвърлен/а към външен уеб сайт,"
echo "който използва твоите дата и място на раждане, за да изчисли профила ти. Тази стъпка можеш да пропуснеш."
echo.
ping -n 11 127.0.0.1 > nul
CHOICE /c:yn /m                         "Искам да знам как да изразявам себе си правилно."
if errorlevel 2 (
 echo "Но за момента няма да използвам онзи сайт."
 goto INTELLI
) 
if errorlevel 1 (
  rundll32 url.dll, FileProtocolHandler https://www.humandesignbulgaria.com/free-human-design-chart/
  echo "И сега след като получих резултат копирам типът (Type:) тук :"
)
set /p aura=
if %aura%==Генератор echo "Мога да правя толкова много неща!... Когато намеря нещо, което ме вдъхновява мога да се занимавам сякаш безкрайно. Понякога обаче от вълнение бързам да действам и тогава не се получава. Все още ми е трудно да запазя търпение - изисква голяма дисциплина. Поемам отговорност да чакам подходящия момент и да следя внимателно кога съм получил/а покана да действам." && pause && goto INTELLI
if %aura%==Манифестор echo "Аз действам. Не виждам другите какво се размотават. Но ако не съм предупредил, че ще направя нещо, обикновено не се получават намеренията ми. Разбирам го. Затова поемам отговорност да предупреждавам другите, да им дам възможност да реагират на моите планове. Не всички могат да задействат ситуацията и групата. Това е отговорност, която уважавам." && pause && goto INTELLI
rem if %aura%=='Manifesting Generator' echo "Понякога от вълнение бързам да направя нещо и тогава не се получава. Знам, че мога да се развивам бързо и да прескачам стъпала, но все още ми е трудно да запазя търпение - изисква голяма дисциплина. Поемам отговорност да чакам подходящия момент и да следя внимателно кога съм получил/а покана да действам." && pause && goto INTELLI
if %aura%==Прожектор echo "Осъзнах, че другите не ме разбират и затова не могат да ме оценят. Вече съм спокоен/спокойна с това. Знам кога другите ме канят да разкрия моята уникална гледна точка. А аз наистина мога да им разкрия неща за тях, които и те самите не забелязват. Затова поемам отговорност когато имам покана да посвещавам." && pause && goto INTELLI
if %aura%==Рефлектор echo "Постоянно се изменям - сякаш характерът ми зависи от компанията, в която съм... Затова се отказах от хората, които ме задържат и положих усилия да започна наново. Мога да виждам всички гледни точки, усещам чувствата, които не са изразени. Поемам отговорност да изразя истината такава каквато е." && pause && goto INTELLI
rem упражнение - медитация

rem ТРЕТИ ДЕН
:INTELLI
cls
echo.
echo                "В такива несигурни времена е необходимо да се подготвя. Уменията са най- ценните, защото ресурсите се изберпват, а инструментите се изхабяват."
echo.
ping -n 11 127.0.0.1 > nul
echo                                                          "Моята интелигентност е ..."
ping -n 3 127.0.0.1 > nul
intelligence.png
echo.
echo "1) naturalist"
echo "2) spatial"
echo "3) musical"
echo "4) logical"
echo "5) interpersonal"
echo "6) kinesthetic"
echo "7) linguistic"
echo "8) personal"
echo.
ping -n 8 127.0.0.1 > nul
echo "Затова поемам отговорност да положа усилия в това, което ми се отдава. Да се подготвя,  за да ..."
CHOICE /c:12345678
if errorlevel 8 (
 set intellig='personal'
 echo "... мога да запазя самообладание в трудни ситуации чрез дишане, медитация, равносметка. Съсредоточавам се над това, което е под мой контрол и приемам това, на което не мога да повлияя."
 pause
 goto GENERATION
)
if errorlevel 7 (
 set intellig='linguistic'
 echo "... имам умения в телекомуникацията - честоти, радио."
 rem упражнение за приказващите - записване на мислите на диктофон/дневник
 pause
 goto GENERATION
)
if errorlevel 6 (
 set intellig='kinesthetic'
 echo "... мога да реагирам бързо при извънредни обстоятелства - имам every day carry (EDC), подготвена екипировка за оцеляване извън зоната на комфорт за 72 часа (палатка, спален чувал, газов котлон) bug out bag (BoB). Имам умения в самозащитата."
 pause
 goto GENERATION
)
if errorlevel 5 (
 set intellig='interpersonal'
 echo  ... съм готов/а да окажа долекарска помощ - диагностициране, реагиране, измъкване от опасно място и каквото друго е нужно."
 pause
 goto GENERATION
)
if errorlevel 4 (
 set intellig='logical'
 echo " ... мога да правя домашни изделия - свещи, сапун, прибори, паста за зъби, шампоан, репелент. Мога да поправям коли. Мога да направя или знам как да използвам алтернативи на електрическата мрежа - генератор, велогенератор, воденица."
 rem упражнение за логично мислещите - отвори тази програма като текст и погледни как е направена
 pause
 goto GENERATION
)
if errorlevel 3 (
 set intellig='musical'
 echo "... мога да изразявам това, което много хора мислят или преживяват. Мога да го изразя чрез музикални инструменти и това е важно за сплотеността на съгражданите ми."
 pause
 goto GENERATION
)
if errorlevel 2 (
 set intellig='spatial'
 echo "... мога да се занимавам с изработване на легло, на типи, на пещ, на къща от подръчни средства като клони, кал и каквото друго намеря."
 pause
 goto GENERATION
)
if errorlevel 1 (
 set intellig='naturalist'
 echo "... мога да се занимавам с разпознаване на растения с хранителни или медицински свойства, събиране, съхраняване, преработване, използване; градинарство, хидропоника; оцеляване навън - ориентиране, къмпингуване; животновъдство."
 pause
 goto GENERATION
)

rem ЧЕТВЪРТИ ДЕН
:GENERATION
echo.
echo "Изобщо взето умни сме тези, които откриваме начини да направим така, че едновременно на нас да ни е добре и на другите да им е добре. Възможно е! Случва се постоянно."
echo.
pause
cls
echo.
echo "Имам навършени ... години."
set /p age=
if %age% GTR 30 (
  rem Prophet
  echo "Тридесет години преход и все още няма край..."
  echo "Всъщност преходът вече премина - 2013г. бележи преломен момент! Вече е време всеки да поеме отговорност и да се погрижи за себе си, за да можем заедно да се спасим от пропастта."
  echo.
  pause
  goto Credits
)
if %age% LSS 30 (
  rem Hero
  echo "Проблемите, които са били отлагани още от времето преди да се родим вече трябва да се решат! Не знам как. Само знам, че заедно можем да ги разрешим."
  echo "Ще бъдем поставени пред избор- Запад или Изток. За добро или лошо алтернативата, в която ние сме безблокова/ неангажирана/ независима държава е с пренебрежително ниска вероятност – така е исторически и няма нови фактори, които да са променили положението."
  echo "Изборът, пред който ще бъдем поставени е привилегия! Повечето държави нямат такъв избор. Това е едновремменно привилегия и отговорност. Затова ще вземем това решение много внимателно."
  echo.
  pause
  goto Credits
) 
if %age% LSS 7 (
  rem Artist
 echo "Докато израствам се грижат особено внимателно за мен, зашото времената са опасни. Аз поемам отговорност да мисля предварително за последствията от действията ми и да се поставям в опасни ситуации само когато е нужно."
 echo.
 pause
 goto Credits
) 
:Credits
cls
echo "Това е прототип на инструмента за себеопознаване. Разбира се - това е външен инструмент и се основава на логика."
echo.
echo "Препоръчително е да се използват и други собствени методи, като медитиране, които се основават на интуиция."
echo.
timeout /t 7
echo.
echo "Свикнали сме да свързваме и да мислим за цивилизацията като централизирана власт и закони. Във времената на изпитания ще открием, че централизираната власт не е способна да управлява хаоса. Ще открием, че законите са ненужни за добронамерените и освен това не спират злонамерените. Ще се върнем към природните закони. Затова започваме със себе си."
echo.
Choice /c:yn /M "Би ли искал/а да пробваш отново или да пробваш за друг?"	
if errorlevel 2 exit
if errorlevel 1 goto :START
